000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/Штрихкоды/Штрихкоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Штрихкоды</name>
  <resources>
    <name>ДатаИзменения</name>
    <comment>Внешнее управление: NAV</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Блокирован</name>
    <comment>Внешнее управление: NAV</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПредставлениеШтрихкода</name>
    <type>
      <types>Characteristic.ТипыШтрихкодов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>Characteristic.ТипыШтрихкодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШтрихкода</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ТипыШтрихкодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/Штрихкоды/ManagerModule.bsl
Функция ПолучитьДанныеПоШтрихкодам(Штрихкоды, ВернутьСписокВыбора = Ложь) Экспорт

	Если ВернутьСписокВыбора Тогда

			ДанныеПоШтрихкодам = Новый СписокЗначений;

	Иначе	ДанныеПоШтрихкодам = Новый Соответствие;

	КонецЕсли;

	МассивШтрихкодов = Новый Массив;

	Для Каждого ТекШтрихкод Из Штрихкоды Цикл

		МассивШтрихкодов.Добавить(ТекШтрихкод);

		Если НЕ ВернутьСписокВыбора Тогда

			ДанныеПоШтрихкодам.Вставить(ТекШтрихкод, Новый Структура);

		КонецЕсли;

	КонецЦикла;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Штрихкоды.Владелец.Код КАК Код,
	|	Штрихкоды.Штрихкод КАК Штрихкод,
	|	Штрихкоды.Владелец КАК Номенклатура,
	|	Штрихкоды.Характеристика КАК Характеристика,
	|	Штрихкоды.Упаковка КАК Упаковка,
	|	Штрихкоды.Владелец.Наименование КАК КлючПорядка
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод В(&МассивШтрихкодов)
	|	И Штрихкоды.Владелец ССЫЛКА Справочник.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	КлючПорядка"
	);
	Запрос.УстановитьПараметр("МассивШтрихкодов", МассивШтрихкодов);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Если ВернутьСписокВыбора Тогда

			ДанныеПоШтрихкодам.Добавить(Выборка.Номенклатура, "(" + СокрЛП(Выборка.Код) + ") " + СокрЛП(Выборка.Номенклатура) + " -> ШК");

		Иначе

			ТекДанные = ДанныеПоШтрихкодам[Выборка.Штрихкод];
			ТекДанные.Вставить("Номенклатура"  , Выборка.Номенклатура);
			ТекДанные.Вставить("Характеристика", Выборка.Характеристика);
			ТекДанные.Вставить("Упаковка"      , Выборка.Упаковка);

		КонецЕсли;

	КонецЦикла;

	Возврат ДанныеПоШтрихкодам;

КонецФункции
